#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.web_apps.module.citizen_func_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.web_apps.module.push_notif_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.web_apps.module.etl_func_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_private_endpoint.redis_cache_com will be created
  + resource "azurerm_private_endpoint" "redis_cache_com" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-com-redis-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-com-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "io-p-itn-com-redis-01-private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-com-redis-01-private-service-connection"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "redisCache",
            ]
        }
    }

  # azurerm_redis_cache.com will be created
  + resource "azurerm_redis_cache" "com" {
      + access_keys_authentication_enabled = true
      + capacity                           = 2
      + family                             = "C"
      + hostname                           = (known after apply)
      + id                                 = (known after apply)
      + location                           = "italynorth"
      + minimum_tls_version                = "1.2"
      + name                               = "io-p-itn-com-redis-01"
      + non_ssl_port_enabled               = false
      + port                               = (known after apply)
      + primary_access_key                 = (sensitive value)
      + primary_connection_string          = (sensitive value)
      + private_static_ip_address          = (known after apply)
      + public_network_access_enabled      = true
      + redis_version                      = "6"
      + replicas_per_master                = (known after apply)
      + replicas_per_primary               = (known after apply)
      + resource_group_name                = "io-p-itn-com-rg-01"
      + secondary_access_key               = (sensitive value)
      + secondary_connection_string        = (sensitive value)
      + sku_name                           = "Standard"
      + ssl_port                           = (known after apply)
      + tags                               = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }

      + patch_schedule {
          + day_of_week        = "Sunday"
          + maintenance_window = "PT5H"
          + start_hour_utc     = 23
        }

      + redis_configuration {
          + authentication_enabled          = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = (known after apply)
          + maxmemory_delta                 = (known after apply)
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = (known after apply)
        }
    }

  # module.web_apps.module.cqrs_func.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      ~ enabled                  = false -> true
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/metricAlerts/io-p-itn-com-cqrs-func-01] Health Check Failed"
        name                     = "io-p-itn-com-cqrs-func-01] Health Check Failed"
        tags                     = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "0.3.1"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.storage_api_weu.azurerm_storage_container.message_content,
  on ../_modules/storage_accounts/storage_account_api.tf line 32, in resource "azurerm_storage_container" "message_content":
  32:   storage_account_name  = module.storage_api.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

(and 5 more similar warnings elsewhere)

Warning: Deprecated attribute

  on ../_modules/storage_accounts/storage_account_io_com.tf line 32, in resource "azurerm_storage_container_immutability_policy" "deleted_messages_logs":
  32:   storage_container_resource_manager_id = azurerm_storage_container.deleted_messages_logs.resource_manager_id

The attribute "resource_manager_id" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
